<template>
  <div>
    <p id="p1">day04</p>
    <p id="line"></p>
    <p id="p2"></p>
    <p id="line"></p>
    <p><span>测试</span></p>
    <div>
      <p id="p4">======</p>
      <p id="p5">
        您可以使用
        伪元素果添加到文本的第一行更多的文字。越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多。伪元素果添加到文本的第一行更多的文字。越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多。伪元素果添加到文本的第一行更多的文字。越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多。伪元素果添加到文本的第一行更多的文字。越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多。
      </p>
      <p id="p4">======</p>
      <p id="p6">
        您可以使用
        伪元素果添加到文本的第一行更多的文字。越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多。伪元素果添加到文本的第一行更多的文字。越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多。伪元素果添加到文本的第一行更多的文字。越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多。伪元素果添加到文本的第一行更多的文字。越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多，越来越多。
      </p>
      <p id="p4">======</p>
      <div id="p7"></div>
    </div>
  </div>
</template>

<script>
export default {
  name: "Day04",
  components: {},
  props: [],
  data() {
    return {};
  },
  created() {
    setInterval(() => {
      console.log("sss");
    }, 1000);
  },
  mounted() {},
  activited() {},
  update() {},
  beforeRouteUpdate() {},
  methods: {},
  filter: {},
  computed: {},
  watch: {}
};
</script>

<!-- 加了scoped 表示css只适用于该vue -->
<style src="./day04.scss" scoped></style>
